trade_exp/src/Documents/СторнированиеУдержаний/СторнированиеУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c15acf72-b338-43aa-a7ed-b97ab7a032c1">
  <name>СторнированиеУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ddce69f3-d439-457b-985b-b13bc9d2ab08">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d98ceadd-9f7a-4c70-9171-23bfbf73f50c">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3f2f69c-7788-441f-9c20-e42f7084088c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="e5ef9eb7-0c26-4ac3-a8fa-94556096b017">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="56162c02-9d7f-492d-b6e5-de78f35be961">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ca6dbefb-30db-412a-96e5-d8597c8c6828">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12f96126-c4de-450e-a5c8-1080131990c9">
      <name>СуммаЗадержки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ffa45e09-552d-4292-a7d3-a9ec51019b8c">
      <name>СуммаУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e3a78b7b-5f85-4823-8d94-013e35409c44">
      <name>СуммаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cf8d7595-e920-4e03-b44d-b47abdc1fd8d">
      <name>СуммаСторно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/СторнированиеУдержаний/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СторнированиеУдержаний") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"СторнированиеУдержаний", НСтр("ru = 'Сторнирование удержаний'"), СформироватьПечатнуюФорму(МассивОбъектов));
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросФормированиеПечатнойФормы(СсылкаНаДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СторнированиеУдержанийНачисления.Сотрудник КАК Сотрудник,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаЗадержки) КАК СуммаЗадержки,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаУдержания) КАК СуммаУдержания,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаВозврата) КАК СуммаВозврата,
	|	СУММА(СторнированиеУдержанийНачисления.СуммаСторно) КАК СуммаСторно,
	|	СторнированиеУдержанийНачисления.Ссылка.Ссылка КАК Ссылка,
	|	СторнированиеУдержанийНачисления.Ссылка.Номер КАК Номер,
	|	СторнированиеУдержанийНачисления.Ссылка.Дата КАК Дата,
	|	СторнированиеУдержанийНачисления.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	СторнированиеУдержанийНачисления.Ссылка.Автор КАК Автор,
	|	СторнированиеУдержанийНачисления.Ссылка.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.СторнированиеУдержаний.Начисления КАК СторнированиеУдержанийНачисления
	|ГДЕ
	|	СторнированиеУдержанийНачисления.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СторнированиеУдержанийНачисления.Сотрудник,
	|	СторнированиеУдержанийНачисления.Ссылка.Ссылка,
	|	СторнированиеУдержанийНачисления.Ссылка.Номер,
	|	СторнированиеУдержанийНачисления.Ссылка.Дата,
	|	СторнированиеУдержанийНачисления.Ссылка.ПериодНачисления,
	|	СторнированиеУдержанийНачисления.Ссылка.Автор,
	|	СторнированиеУдержанийНачисления.Ссылка.Комментарий
	|
	|УПОРЯДОЧИТЬ ПО
	|	СторнированиеУдержанийНачисления.Сотрудник.Наименование
	|ИТОГИ
	|	СУММА(СуммаЗадержки),
	|	СУММА(СуммаУдержания),
	|	СУММА(СуммаВозврата),
	|	СУММА(СуммаСторно)
	|ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	
	Возврат Выборка;
КонецФункции


Функция СформироватьПечатнуюФорму  (СсылкаНаДокумент) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("СторнированиеУдержаний");
	
	ОбластьЗаголовок = МакетОбработки.ПолучитьОбласть("Заголовок");
	ОбластьНачисленияШапка = МакетОбработки.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = МакетОбработки.ПолучитьОбласть("Начисления");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	
Для каждого Ссылка из СсылкаНаДокумент Цикл			
		Выборка = ЗапросФормированиеПечатнойФормы(Ссылка.Ссылка);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисленияШапка.Параметры,Выборка);
			ЗаполнитьЗначенияСвойств(ОбластьНачисления.Параметры,Выборка);
	 		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,Выборка);	
			ТабличныйДокумент.Очистить();
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок,Выборка.Уровень());

		ТабличныйДокумент.Вывести(ОбластьНачисленияШапка);
		Ном=1;
		ВыборкаНачисления = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ОбластьНачисления.Параметры.НомерСтроки= Ном;
			ТабличныйДокумент.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
				Ном=Ном+1;

		КонецЦикла;
	ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);

		
	КонецЦикла;

		КонецЦикла;
	Возврат ТабличныйДокумент;

КонецФункции

#КонецЕсли
